'use strict'
// 

//пример 1
//let a = 1, b = 1, c, d; c = ++a;
//alert(c); // ответ: 2  
//сначало а увеличится на 1 затем выведется как а=2

//пример 2 
//d = b++;
//alert(d); //ответ: 1 
// выведется b = 1 а затем увеличится на 1 и запомниться как b=2

//пример 3 c = 2 + ++a; alert(c); //ответ: 5 
// к  числу 2 прибавляется увеличенное на 1(а=3) значение а из первого примера (а=2)

//пример 4 
//d = 2 + b++; alert(d); //ответ: 4 
// к чисду 2 прибавляется число b=2 (из примера 2) а затем b увеличивается на 1
//alert(a); //3 alert(b); //3 
//(результат увеличения числа b при помощи постфиксного инкримента в примере 2 и 4)
